# StructuralCustomConnectionEmpty Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralCustomConnectionFailures..::..StructuralCustomConnectionEmpty Property
BuiltInFailures..::..StructuralCustomConnectionFailures Class See Also
---
Structural Custom Connection cannot be empty.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StructuralCustomConnectionEmpty { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralCustomConnectionEmpty As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StructuralCustomConnectionEmpty {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StructuralCustomConnectionFailures Class
Autodesk.Revit.DB Namespace